export const projectData = {
  '一米市集小程序 ': {
    name: '一米市集小程序',
    title: '主程序员',
    time: '2019.01 - 2023.12',
    skills: ['微信原生小程序'],
    desc: [
      '该项目为一米市集生鲜电商。由我主动调研微信小程序技术方案并产出 demo，并对比原一米微商城优缺点后，向上级提出一米微商城转向一米市集小程序的建议。',
      '经批准后由我牵头推动《一米市集小程序》项目完满交付上线（19年1月立项，3月中旬正式上线替代一米微商城）。项目包括电商购物流程，团购、社区团购、门店扫码购、线下收钱工具、直播等功能。',
      '该项目上线后受到业务部门的好评,完美替代h5版本微商城，加载速度和用户体验都有很大的提升，对业务部门拉新作用提升明显。',
      '我职级晋升为资深前端开发工程师，小组成员也都被加薪。'     
    ],
    work: [
      '1、进行技术选型，制定代码规范;',
      '2、从0到1搭建基础架构,封装核心业务组件;',
      '3、采用敏捷开发的模式，拆解任务，推进项目快速落地；',
      '4、持续进行性能优化，提升小程序加载速度；',
      '5、业务埋点、收集用户日志；',
      '6、主动引入直播功能，让业务部门有了新的业绩拓展渠道；',
      '7、封城期间快速推动社区团购功能的落地；'
    ]
  },
  '一米市集提货平台': {
    name: '一米市集提货平台',
    title: '主程序员',
    time: '2020.01 - 2023.12',
    skills: ['微信原生小程序'],
    desc: [
      '该项目主要用于企业用户向员工、客户发放福利。支持中英文双语言',
    ],
    work: [
      '1、从0到1负责搭建基础架构；',
      '2、数据埋点，用户日志收集；',
      '3、与小组成员一起开发落地，并一直维护至今。'
    ]
  },
  '一米市集企业购小程序': {
    name: '一米市集企业购小程序',
    title: '主程序员',
    time: '2022.06 - 2023.12',
    skills: ['微信原生小程序'],
    desc: [
      '该项目主要用于企业用户向员工、客户发放福利，',
    ],
    work: [
      '1、从0到1负责搭建基础架构；',
      '2、数据埋点，收集用户日志；',
      '3、独自开发落地。主要有多账户切换，付款路径权限切换。'
    ]
  },
  '电商内容管理平台CMS': {
    name: '电商内容管理平台CMS',
    title: '主程序员',
    time: '2019.03 - 2023.12',
    skills: ['vue', 'ant-design-vue', 'scss', 'axios'],
    desc: [
      '因三方ec后台内容管理模块编辑交互功能对运营非常不友好，无法实时知晓编辑的内容在c端显示的真实情况。不仅配置页面耗费时间较长，也容易出现内容配置错误的情况，因此立项。',
      '该项目为一米市集电商的可视化内容管理平台，特点是通过拖拽组件的方式搭建前端页面，与c端保持高度一致，页面所见即所得。',
      '项目上线后，受到业务部门的好评。经反馈平均页面配置时间缩短 50%，内容出错率也大大下降。'
    ],
    work: [
      '1、参与项目技术选型，制定项目规范；',
      '2、从0到1搭建项目基础架构；',
      '3、设计页面数据模型，封装组件拖拽功能。'
    ]
  },
  '一米市集官网': {
    name: '一米市集官网',
    title: '主程序员',
    time: '2018.01 - 2023.12',
    skills: ['js', 'css', 'html5'],
    desc: [
      '项目链接 https://www.yimishiji.com'
    ],
    work: [
      '1、拆分任务，把控项目质量、交付上线',
      '2、seo搜索优化',
      '3、响应式'
    ]
  },
  '一米市集微商城': {
    name: '一米市集微商城',
    title: '前端开发',
    time: '2016.09 - 2023.12',
    skills: ['react', 'webpack', 'php'],
    desc: [
      '项目链接 https://m.yimishiji.com',
      '项目包括生鲜电商购物流程，以及如年度账单、mgm 邀新、年夜饭，抽奖等几十个活动页面'
    ],
    work: [
      '1、引入 react技术栈;',
      '2、参与项目由 java 版本转向 php 版本，负责其中前端页面部分开发;',
      '3、后面开始接手 php mvc 部分代码开发，将项目完全接下;',
      '4、开发h5活动页，对接小程序、安卓、ios客户端，制定交互规则。'
    ]
  },
  '食芯资本官网': {
    name: '食芯资本官网',
    title: '主程序员',
    time: '2021.06 - 2021.06',
    skills: ['wordpress', 'js', 'html5', 'css3', 'php'],
    desc: [
      '项目链接 https://www.bitsxbites.cn',
      '子公司官网'
    ],
    work: [
      '1、研究wordpress，对接wordpress后台插件提供的功能;',
      '2、从0到1独立完成网站开发',
      '3、响应式，pc、移动端自适应'
    ]
  },
}