export const CompanyInfo = {
  c1: {
    name: '上海傲文网络技术有限公司',
    position: '高级前端开发工程师',
    period: '2024.03 - 2026.08',
    desc: [
      '担任前端小组长，负责项目基础层技术方案设计（公共组件、基础架构、通用能力建设），把控技术选型与方案落地',
      '日常需求评审，开发管理，每日站会同步信息，向技术部经理汇报工作',
      '制定代码规范，定期组织CR，保证代码质量',
      '前端工程化，优化开发效率、代码构建发布流程',
      '探索AI Coding在项目中落地，团队内推广，编码效率提升40%'
    ]
  },
  c2: {
    name: '上海原裕商贸有限公司（一米市集）',
    position: '资深前端开发工程师',
    period: '2016.09 - 2023.12',
    desc: [
      '公司前端开发负责人，负责项目技术选型、项目从0到1的架构；',
      '日常需求评审，开发管理，每日站会同步信息，向技术部经理汇报工作',
      '制定代码规范，定期组织CR，保证代码质量',
      '前端工程化，优化开发效率、代码构建发布流程',
      '备注：劳动合同中间有多次内部变更，但工作对象皆为一米市集。',
      '1、16年9月入职，18年中晋升前端组长，负责前端小组日常开发管理',
      '2、推动一米市集小程序项目落地，19年4月晋升资深前端开发工程师'
    ]
  }
}